{
    "page-title": "About Me - Cassiel Williams",
    "logo-name": "Cassiel Williams",
    "nav-home": "Home",
    "nav-about": "About",
    "nav-projects": "Projects",
    "nav-contact": "Contact",
    "about-hero-title": "About Me",
    "about-hero-subtitle": "Software Engineer & Problem Solver",
    "about-background-title": "Background",
    "about-background-p1": "I'm a recent graduate from the British Columbia Institute of Technology's Computer Systems Technology program, where I completed the Programming Paradigms specialization with distinction. My academic journey equipped me with a deep understanding of diverse programming languages, system architecture, and software development best practices.",
    "about-background-p2": "Before transitioning into software development, I spent over a decade working as a professional actor and puppeteer. This experience taught me invaluable skills in collaboration, adaptability, precision, and the importance of continuous improvement through feedback—all of which translate directly to writing better code and working effectively in development teams.",
    "about-background-p3": "I've also worked in Quality Assurance at Electronic Arts, where I developed a keen eye for detail, learned to think like an end user, and understood the critical importance of thorough testing and documentation in software development.",
    "about-philosophy-title": "Development Philosophy",
    "about-philosophy-p1": "I believe great software is built on a foundation of understanding the problem deeply before jumping to solutions. I'm passionate about backend development and system optimization—the kind of work that happens behind the scenes but makes everything run smoothly and efficiently.",
    "about-philosophy-p2": "I take pride in writing clean, maintainable code that others can understand and build upon. Whether I'm debugging a tricky issue, refactoring legacy code, or implementing a new feature, my goal is always to leave the codebase better than I found it.",
    "about-interests-title": "Interests & Focus Areas",
    "about-technical-title": "Backend & Systems",
    "about-technical-desc": "I thrive on solving complex backend challenges, optimizing database queries, designing efficient APIs, and improving system performance. I enjoy working with languages like Java, C, Python, Rust, and exploring functional programming paradigms.",
    "about-creative-title": "Creative Problem Solving",
    "about-creative-desc": "My background in performance arts has given me a unique perspective on problem-solving. I approach technical challenges with creativity, viewing constraints as opportunities to find elegant solutions.",
    "about-learning-title": "Continuous Learning",
    "about-learning-desc": "Technology evolves rapidly, and I'm committed to staying current. I regularly explore new programming languages, frameworks, and development methodologies. I'm particularly interested in AI/ML applications and how they can solve real-world problems.",
    "about-journey-title": "My Journey",
    "about-journey-bcit": "BCIT Computer Systems Technology",
    "about-journey-bcit-desc": "Graduated with distinction from the Programming Paradigms specialization. The program exposed me to a wide range of languages and paradigms—from low-level systems programming in C to functional programming in OCaml and Elixir, to AI/ML work with Python and TensorFlow. This diverse exposure taught me to pick the right tool for the job and adapt quickly to new technologies.",
    "about-journey-performance": "Performance & Collaboration",
    "about-journey-performance-desc": "My years as a professional performer taught me how to work under pressure, take direction, iterate based on feedback, and collaborate effectively with diverse teams. These soft skills have proven invaluable in development environments where communication and teamwork are just as important as technical ability.",
    "about-journey-future": "Looking Forward",
    "about-journey-future-desc": "I'm excited to bring my unique combination of technical expertise, creative problem-solving, and collaborative spirit to a development team. I'm particularly interested in backend roles where I can contribute to building scalable, efficient systems that make a real impact."
}
