{
    "page-title": "FIRST Robotics - Cassiel Williams",
    "logo-name": "Cassiel Williams",
    "nav-home": "Home",
    "nav-about": "About",
    "nav-projects": "Projects",
    "nav-contact": "Contact",
    "project-title": "FIRST Robotics Competition",
    "project-subtitle": "Custom robot programming and wireless control systems",
    "back-to-projects": "← Back to Projects",
    "overview-title": "Overview",
    "overview-p1": "Designed and programmed autonomous and teleoperated control systems for a competitive robotics platform as part of the FIRST Robotics Competition. Developed embedded software using LabVIEW on Raspberry Pi hardware to control motors, sensors, and actuators in a high-stakes competition environment.",
    "overview-p2": "The project required creating reliable, responsive control systems that could function both autonomously during the initial competition phase and under human control during teleoperation. The robot needed to perform complex tasks including object manipulation, precise navigation, and coordinated multi-system operations—all while maintaining robust wireless connectivity in an arena filled with radio interference.",
    "tech-stack-title": "Technologies Used",
    "tech-1": "LabVIEW",
    "tech-2": "Raspberry Pi",
    "tech-3": "Embedded Systems",
    "tech-4": "PWM Control",
    "tech-5": "Wireless Networking",
    "tech-6": "PID Controllers",
    "features-title": "Key Features",
    "feature-1-title": "Autonomous Navigation System",
    "feature-1-desc": "Implemented autonomous routines using sensor fusion from encoders, gyroscopes, and vision systems. Developed pathfinding algorithms and PID control loops for precise positioning during the autonomous period. The system could execute pre-programmed sequences while adapting to real-time sensor feedback.",
    "feature-2-title": "Stable Wireless Control Architecture",
    "feature-2-desc": "Built robust wireless communication system between driver station and robot controller, implementing error detection, packet validation, and graceful degradation. Created fallback mechanisms to maintain basic functionality even with degraded signal quality, crucial in competition environments with significant RF interference.",
    "feature-3-title": "Motor Control Interface",
    "feature-3-desc": "Developed sophisticated motor control systems interfacing with various actuators including drive motors, arms, and manipulators. Implemented current limiting, acceleration curves, and synchronization logic to prevent mechanical stress while maintaining responsive controls. Created mapping between joystick inputs and multi-motor coordinated movements.",
    "feature-4-title": "Real-Time Telemetry Dashboard",
    "feature-4-desc": "Built comprehensive telemetry system providing real-time feedback on robot status, sensor readings, and system health. Enabled drivers and technicians to monitor performance, diagnose issues, and make strategic decisions during matches. Implemented data logging for post-match analysis and system optimization.",
    "challenges-title": "Challenges & Solutions",
    "challenges-p1": "The most significant challenge was ensuring reliable wireless connectivity in an environment with 30+ robots operating simultaneously, causing severe RF congestion. Initial implementations suffered from frequent disconnects and command latency spikes that made the robot difficult to control precisely.",
    "challenges-p2": "I solved this by implementing a multi-layered approach: optimized packet sizes to reduce transmission time, added command buffering to smooth out latency spikes, implemented predictive dead-reckoning so the robot could continue executing commands during brief disconnects, and added aggressive error recovery with automatic reconnection. Also worked with the team to optimize antenna placement and shielding to minimize interference susceptibility.",
    "learnings-title": "What I Learned",
    "learnings-p1": "This project taught me embedded systems programming and the unique constraints of real-time control systems. I learned to think in terms of timing guarantees, interrupt handling, and resource-constrained environments. Working with LabVIEW introduced me to dataflow programming paradigms and graphical programming techniques that complement traditional text-based languages.",
    "learnings-p2": "Beyond technical skills, the competition environment taught me to work under pressure, debug rapidly during time-limited matches, and collaborate effectively with a diverse team including mechanical engineers, electricians, and strategists. I learned the critical importance of thorough testing, graceful error handling, and building systems that perform reliably even when conditions aren't ideal—lessons that apply to all software development."
}
