{
    "page-title": "MRI VR Simulation - Cassiel Williams",
    "logo-name": "Cassiel Williams",
    "nav-home": "Home",
    "nav-about": "About",
    "nav-projects": "Projects",
    "nav-contact": "Contact",
    "project-title": "MRI VR Simulation",
    "project-subtitle": "Immersive VR training environment for clinical MRI workflows",
    "back-to-projects": "← Back to Projects",
    "overview-title": "Overview",
    "overview-p1": "Developed a comprehensive virtual reality training simulation for MRI technologists and medical students. This immersive application recreates a clinical MRI environment where users can practice patient positioning, safety protocols, and machine operation in a risk-free setting.",
    "overview-p2": "The simulation addresses the challenge of providing hands-on MRI training without the high costs and safety risks associated with using real equipment. Built with Unity and OpenXR for cross-platform VR compatibility, the application provides realistic interactions and guided workflows that mirror actual clinical procedures.",
    "tech-stack-title": "Technologies Used",
    "tech-1": "Unity Engine",
    "tech-2": "C#",
    "tech-3": "OpenXR",
    "tech-4": "XR Interaction Toolkit",
    "tech-5": "3D Modeling",
    "features-title": "Key Features",
    "feature-1-title": "Realistic Patient Interactions",
    "feature-1-desc": "Implemented comprehensive patient interaction logic allowing users to communicate with virtual patients, position them correctly on the MRI table, and ensure their comfort and safety throughout the simulated procedure. Includes realistic physics-based movements and collision detection.",
    "feature-2-title": "Interactive Equipment Controls",
    "feature-2-desc": "Created functional virtual replicas of MRI control panels and equipment interfaces. Users can adjust table positions, initiate scans, and respond to system alerts, providing authentic practice with the complex machinery without risk of equipment damage or patient harm.",
    "feature-3-title": "Safety Protocol Training",
    "feature-3-desc": "Built-in safety checklist system that guides users through critical pre-scan procedures including metal detection, patient screening, and contraindication checks. The system provides real-time feedback and scoring to reinforce proper safety protocols.",
    "feature-4-title": "Cross-Platform VR Support",
    "feature-4-desc": "Utilized OpenXR standard to ensure compatibility across multiple VR platforms including Meta Quest, HTC Vive, and Valve Index. This maximizes accessibility for training institutions with different VR equipment.",
    "challenges-title": "Challenges & Solutions",
    "challenges-p1": "The primary challenge was creating realistic physics interactions that felt natural in VR while maintaining smooth performance. Complex interactions like patient positioning required careful balance between realism and usability. Initial implementations caused motion sickness due to unexpected movements.",
    "challenges-p2": "I solved this by implementing a hybrid interaction system combining direct manipulation for gross movements with snap-to-grid positioning for fine adjustments. Added haptic feedback to reinforce successful interactions and implemented comfort options including teleport movement and adjustable field-of-view vignetting to reduce motion sickness.",
    "learnings-title": "What I Learned",
    "learnings-p1": "This project significantly deepened my understanding of Unity's XR development pipeline, C# game architecture patterns, and the importance of user experience in VR applications. I learned to design interactions specifically for the constraints and opportunities of virtual reality, including spatial UI design and gesture-based controls.",
    "learnings-p2": "Working on a training simulation taught me the importance of balancing educational effectiveness with engagement. I learned to collaborate with medical professionals to ensure clinical accuracy while making the experience intuitive for users unfamiliar with MRI procedures. The project reinforced the value of iterative testing and user feedback in creating effective educational software."
}
