{
    "page-title": "Safety Scanner - Cassiel Williams",
    "logo-name": "Cassiel Williams",
    "nav-home": "Home",
    "nav-about": "About",
    "nav-projects": "Projects",
    "nav-contact": "Contact",
    "project-title": "Safety Scanner",
    "project-subtitle": "AI-powered safety label parser for workplace hazard identification",
    "back-to-projects": "← Back to Projects",
    "overview-title": "Overview",
    "overview-p1": "Safety Scanner is an AI-powered application designed to help workers quickly identify and understand workplace hazards by scanning safety labels and WHMIS symbols. Using advanced OCR and machine learning, the system can parse safety labels, extract key information, and provide comprehensive safety summaries.",
    "overview-p2": "The project addresses a real-world problem: workers often encounter unfamiliar chemical labels or safety symbols and need quick, accurate information to work safely. This tool makes that information accessible through a simple image upload interface.",
    "tech-stack-title": "Technologies Used",
    "tech-1": "Python",
    "tech-2": "HuggingFace Transformers",
    "tech-3": "TrOCR",
    "tech-4": "Flask API",
    "tech-5": "REST",
    "features-title": "Key Features",
    "feature-1-title": "Optical Character Recognition",
    "feature-1-desc": "Leverages HuggingFace's TrOCR (Transformer-based OCR) model to accurately extract text from safety labels, even with challenging fonts, angles, or lighting conditions. The model was fine-tuned to handle the specific formatting of WHMIS and safety labels.",
    "feature-2-title": "Intelligent Label Parsing",
    "feature-2-desc": "Analyzes extracted text to identify key safety information including hazard classifications, precautionary statements, signal words (Danger/Warning), and required protective equipment. Uses natural language processing to categorize and prioritize information.",
    "feature-3-title": "RESTful API Design",
    "feature-3-desc": "Built a clean, documented REST API that mobile and web clients can easily integrate. Endpoints handle image upload, processing, and return structured JSON responses with safety information, making it simple for frontend developers to build user interfaces.",
    "challenges-title": "Challenges & Solutions",
    "challenges-p1": "The primary challenge was achieving reliable OCR accuracy with the variety of label formats, print qualities, and image conditions workers might encounter in real environments. Many existing OCR solutions struggled with specialized safety symbols and multi-language labels.",
    "challenges-p2": "I addressed this by fine-tuning the TrOCR model on a dataset of safety labels and implementing preprocessing steps to normalize image quality. I also built a fallback system that attempts multiple OCR approaches when confidence is low, significantly improving overall accuracy.",
    "learnings-title": "What I Learned",
    "learnings-p1": "This project deepened my understanding of transformer-based machine learning models and the HuggingFace ecosystem. I learned how to fine-tune pre-trained models for specific use cases, manage model inference performance, and design APIs that abstract complex ML operations behind simple interfaces.",
    "learnings-p2": "Working on a safety-critical application also reinforced the importance of error handling, logging, and providing clear confidence metrics to users. When dealing with workplace safety, the system needs to be transparent about uncertainty rather than making potentially dangerous assumptions."
}
