{
    "page-title": "Songgestions - Cassiel Williams",
    "logo-name": "Cassiel Williams",
    "nav-home": "Home",
    "nav-about": "About",
    "nav-projects": "Projects",
    "nav-contact": "Contact",
    "project-title": "Songgestions",
    "project-subtitle": "AI-powered music recommendation system using machine learning",
    "back-to-projects": "← Back to Projects",
    "overview-title": "Overview",
    "overview-p1": "Developed an intelligent music recommendation web application that analyzes song characteristics and user preferences to suggest similar tracks. The system uses machine learning to understand musical patterns including tempo, key, energy, danceability, and acoustic features to provide personalized recommendations.",
    "overview-p2": "This project addresses the challenge of music discovery in an era of overwhelming choice. Rather than relying solely on collaborative filtering (what similar users like), Songgestions analyzes the intrinsic qualities of music itself, allowing it to recommend lesser-known tracks that match a user's taste profile even when those songs lack extensive listening data.",
    "tech-stack-title": "Technologies Used",
    "tech-1": "Python",
    "tech-2": "TensorFlow",
    "tech-3": "scikit-learn",
    "tech-4": "Pandas",
    "tech-5": "Flask",
    "tech-6": "Spotify API",
    "features-title": "Key Features",
    "feature-1-title": "Neural Network Recommendation Engine",
    "feature-1-desc": "Trained a neural network using TensorFlow to learn complex relationships between musical features. The model analyzes 13+ audio characteristics including acousticness, instrumentalness, speechiness, and valence to create a multi-dimensional similarity space for accurate song matching.",
    "feature-2-title": "Feature Engineering Pipeline",
    "feature-2-desc": "Built comprehensive data preprocessing pipeline using Pandas that normalizes audio features, handles missing data, and creates derived features. Implemented feature scaling and dimensionality reduction techniques to improve model performance and reduce computational overhead.",
    "feature-3-title": "Interactive Web Interface",
    "feature-3-desc": "Developed a clean, responsive web application using Flask that allows users to search for songs, view audio feature visualizations, and receive instant recommendations. The interface displays similarity scores and feature comparisons to help users understand why songs were recommended.",
    "feature-4-title": "Hybrid Recommendation Approach",
    "feature-4-desc": "Implemented a hybrid system combining content-based filtering (audio features) with collaborative filtering techniques to provide both familiar and novel recommendations. This approach balances safe suggestions with discovery of new artists and genres.",
    "challenges-title": "Challenges & Solutions",
    "challenges-p1": "The primary challenge was handling the high dimensionality and variability of music features. Songs can be similar in some dimensions but wildly different in others, making similarity metrics complex. Initial models over-weighted certain features like tempo, leading to recommendations that felt technically similar but subjectively mismatched.",
    "challenges-p2": "I addressed this through extensive hyperparameter tuning and by implementing weighted feature importance based on user feedback. Created a validation dataset with known good recommendations and used it to tune the model. Also implemented a diversity component in the recommendation algorithm to ensure suggested songs weren't too similar to each other, improving the overall recommendation experience.",
    "learnings-title": "What I Learned",
    "learnings-p1": "This project significantly enhanced my machine learning skills, particularly in working with TensorFlow and understanding how to train, validate, and tune neural networks. I learned the importance of feature engineering and how the right preprocessing can dramatically impact model performance. Working with real-world data taught me to handle messy, incomplete datasets.",
    "learnings-p2": "The project also taught me that machine learning is as much art as science—technical accuracy doesn't always equal user satisfaction. I learned to incorporate qualitative feedback into quantitative models and to build systems that explain their recommendations. This experience reinforced the importance of iterative development and user testing in machine learning applications."
}
